import clsx from "clsx";

import ShahidRaisiPortrait from "@/assets/portraits/shahid-raisi.png";

import CtaPricelessBannerComponent from "@/components/cta-priceless-banner/cta-priceless-banner.component";
import FaqItemComponent from "@/components/faq-item/faq-item.component";
import FaqComponent from "@/components/faq/faq.component";
import HeroComponent from "@/components/hero/hero.component";
import LogoImageComponent from "@/components/logo-image/logo-image.component";
import OrderedListComponent from "@/components/ordered-list/ordered-list.component";
import PrerequisitesComponent from "@/components/prerequisites/prerequisites.component";
import ShahidRulesComponent from "@/components/shahid-rules/shahid-rules.component";
import SimpleFeaturesComponent from "@/components/simple-features/simple-features.component";
import TutorComponent from "@/components/tutor/tutor.component";

import styles from "./page.module.css";

export default function Page() {
  return (
    <div id="shahid" className={clsx(styles.page, "light")}>
      <HeroComponent
        subtitle="بوت‌کمپ صلواتی شهید رئیسی"
        subject="طلای گمشده‌ای که دنبالش میگشتی!"
        logo={
          <LogoImageComponent src={ShahidRaisiPortrait.src} alt="شهید رئیسی" />
        }
        description={
          <>
            <p>
              هرچی تلاش میکنی نمیتونی کار پیدا کنی؟ برای تمام شرکت‌ها رزومه
              فرستادی اما هیچکدوم جواب ندادن؟ نمیدونی مشکل از کجاست؟ تمام راه‌ها
              به بن‌بست رسیده؟
              <br />
              <b>پس جات اینجاست!</b>
            </p>
            <p>
              اینجا در کنار 7 نفر دیگه، یه تیم تشکیل میدی و روی یه پروژه‌ی واقعی
              کار می‌کنی. اینجوری هم
              {` `}
              <b>کار تیمی</b>
              {` `}
              یاد می‌گیری، هم یه
              {` `}
              <b>نمونه‌کار قوی</b>
              {` `}
              داری که بذاری تو رزومه‌ت.
            </p>
            <p>
              تمام روال‌هایی که تو یه شرکت فنی وجود داره، اینجا شبیه‌سازی شده.
              از Sprint و جلسات روزانه و Code Review بگیر تا جلسات یک به یک و
              Retro و Team Building.
            </p>
            <p>
              کلی کارگاه داریم که بهت کمک میکنه بتونی کار پیدا کنی. از
              رزومه‌نویسی و شبکه‌سازی بگیر تا تکنیک‌های مصاحبه و مهارت نرم.
              خودمم همیشه در دسترسم.
            </p>
            <p>
              تعهد میدم تمام تلاشم‌و کنم که بتونی کار پیدا کنی.
              <br />
              اگه خودتم تعهد و انگیزه و پشتکار داری...
              {` `}
              <b>بسم‌الله</b>!
            </p>
          </>
        }
      />
      <TutorComponent />
      <SimpleFeaturesComponent>
        <li>رایگان</li>
        <li>شبیه‌سازی کار واقعی</li>
        <li>کاملاً دورکاری</li>
        <li>جلسات روزانه و هفتگی</li>
        <li>Agile, Scrum, Sprint</li>
        <li>Retrospective</li>
        <li>Team Building</li>
        <li>Coffee Chat</li>
        <li>Soft Skills</li>
        <li>کار تیمی</li>
        <li>منتورینگ</li>
        <li>Code Review</li>
        <li>درک عمیق JavaScript</li>
        <li>درک عمیق React</li>
        <li>Clean Code</li>
        <li>Tip of the Day</li>
        <li>شبیه‌سازی مصاحبه</li>
        <li>تکنیک‌های مصاحبه فنی</li>
        <li>تکنیک‌های مصاحبه منابع انسانی</li>
        <li>کارگاه‌های متنوع و متعدد</li>
        <li>رزومه‌نویسی</li>
        <li>نمونه‌کار قوی</li>
        <li>شبکه‌سازی</li>
        <li>LinkedIn</li>
      </SimpleFeaturesComponent>
      <PrerequisitesComponent
        technicalItems={[
          "تسلط به HTML و CSS و JavaScript",
          "تسلط به React",
          "آشنایی با Next.js",
          "دانشجو یا فارغ‌التحصیل دانشگاهی",
        ]}
      />
      <CtaPricelessBannerComponent
        title="کاملاً رایگان!"
        subtitle="از آموزش تا استخدام"
        link="https://survey.porsline.ir/s/IVjBStc4"
      />
      <FaqComponent rules={<ShahidRulesComponent />} trimEnd>
        <FaqItemComponent question="چرا باید وثیقه بذارم؟">
          <p>
            همونطور که گفته شد، دوره کاملاً رایگان برگزار میشه و من هیچ نفع مالی
            از این بوت‌کمپ ندارم.
            <br />
            اما از اونجایی که متاسفانه بعضی افراد برای دوره‌های رایگان ارزش قائل
            نیستن، ممکنه وسط دوره انصراف بدن و برنامه‌ریزی رو دچار مشکل کنن.
            <br />
            از طرفی ترک دوره یا بی‌نظمی روی کار باقی افراد هم تاثیر میذاره، چون
            قراره تمام کارها به صورت تیمی انجام بشه و کم‌کاری یه نفر روی کل تیم
            اثر منفی میذاره.
            <br />
            به همین خاطر برای اینکه مطمئن باشیم همه با انگیزه و تلاش قراره تو
            دوره شرکت کنن، مبلغی رو به عنوان وثیقه در نظر گرفتم.
            <br />
            البته توجه داشته باشید که اگه نظم رو رعایت کنید و تسک‌ها رو انجام
            بدید، بعد از 40 روز مبلغ به طور کامل به شما برگردونده میشه. اما در
            غیر این صورت، به یک خیریه اهدا میشه و هیچ بخشی از این مبلغ قرار نیست
            به من برسه.
          </p>
        </FaqItemComponent>
        <FaqItemComponent question="چرا باید صلوات بفرستم؟">
          <p>
            صلواتی انجام دادن کارها جزء فرهنگ‌های زیبای ایرانی-اسلامیه. اکثراً
            این موضوع برای کارهایی مثل نان صلواتی یا ایستگاه صلواتی دیده میشه.
            اما از نظر فقهی لزومی نداره به همین‌ها محدود باشه.
            <br />
            من پیش خودم فکر کردم دیدم می‌تونم از دانش و مهارتم در راستای کمک به
            دیگران استفاده کنم. واسه همین گفتم خیلی خوب میشه اگه آموزش صلواتی هم
            داشته باشیم و این بوت‌کمپ رو راه انداختم.
          </p>
        </FaqItemComponent>
        <FaqItemComponent question="چرا صلوات برای شهدا و چرا شهید رئیسی؟">
          <p>این موضوع چند علت داره:</p>
          <OrderedListComponent>
            <li>
              به طور کلی دوست داشتم یاد و خاطره‌ی شهدا رو زنده نگه دارم. هر
              بوت‌کمپ قراره به یک شهید منسوب بشه و در طول دوره صلوات‌هایی که
              می‌فرستیم رو به اون شهید هدیه کنیم.
            </li>
            <li>
              اعتقاد دارم اگه به یاد شهدا باشیم و ثوابی رو بهشون هدیه کنیم،
              قطعاً این هدیه رو بی‌جواب نمی‌ذارن و به کارمون برکت میدن.
            </li>
            <li>
              شروع بوت‌کمپ مصادف شده با سالگرد شهادت شهید رئیسی؛ بنابراین فکر
              کردم مناسبه اگه این بوت‌کمپ رو به ایشون منسوب کنم.
            </li>
          </OrderedListComponent>
        </FaqItemComponent>
        <FaqItemComponent question="چرا پاورقی؟">
          <p>
            راستش یه چیزی تو این مدتی که با دوستای مختلف حرف زدم برام پررنگ شد:
            اینکه خیلی‌هامون یه جور حس بد نسبت به خودمون و کشورمون داریم. یه حس
            که میگه ما تو بدترین جای دنیا به دنیا اومدیم، همه‌چی اینجا خرابه و
            هیچ امیدی نیست.
          </p>
          <p>
            این حس دلایل مختلفی داره و نمی‌شه راحت قضاوتش کرد. چون واقعاً خیلی
            از مشکلات رو با پوست و استخون‌مون لمس کردیم. اما چیزی که مهمه اینه
            که این حس، خیلی وقتا باعث ناامیدی، بی‌انگیزگی و حتی تصمیم‌های
            عجولانه میشه. مثلاً اینکه بعضیا فکر می‌کنن تنها راه خوشبختی، رفتنه؛
            حالا به هر قیمتی.
          </p>
          <p>
            اینجا بود که من با برنامه‌ی پاورقی آشنا شدم. یه برنامه که نمیاد بگه
            «همه‌چی عالیه» یا «مشکلی نداریم». نه، اتفاقاً خیلی از مشکلات کشور رو
            خیلی رک می‌گه. اما در کنارش، یه دید دیگه هم بهمون می‌ده. اینکه
            مشکلات فقط مال ما نیست. خیلی از چالش‌هایی که فکر می‌کنیم فقط مخصوص
            ایرانه، تو خیلی از کشورهای دیگه هم هست. و حتی بعضی کشورها دردسرهایی
            دارن که ما اینجا تجربه‌ش نکردیم.
          </p>
          <p>
            حرف پاورقی اینه: بیایم واقع‌بین باشیم. نه فقط بدی‌ها رو ببینیم، نه
            فقط خوبی‌ها رو. هر دوتاشو با هم. اینطوری می‌تونیم تصمیم‌هامون رو
            آگاهانه‌تر بگیریم.
          </p>
          <p>
            ممکنه بعد از دیدن برنامه، حس بهتری نسبت به خودمون و کشورمون پیدا
            کنیم، یا برعکس، به این نتیجه برسیم که مهاجرت همچنان انتخاب درستیه.
            ولی تفاوتش اینه که این بار، انتخاب‌مون بر پایه‌ی اطلاعات کامل‌تر و
            نگاه منصفانه‌تریه.
          </p>
          <p>
            منم برای همین، توی بوت‌کمپ ازتون خواستم که پاورقی رو ببینید. نه
            به‌خاطر اینکه بخوام کسی رو مجبور به چیزی کنم، بلکه چون فکر می‌کنم
            این دید متفاوت می‌تونه بهمون کمک کنه تو تصمیم‌گیری‌هامون. چه برای
            موندن، چه برای رفتن.
          </p>
        </FaqItemComponent>
        <FaqItemComponent question="این بوت‌کمپ برای چه افرادی مناسبه؟">
          <p>
            این دوره برای افرادی مناسبه که تسلط خوبی روی مفاهیم اصلی و React
            دارن اما نمیتونن کار پیدا کنن. علت این مشکل می‌تونه رزومه‌ی نامناسب،
            نداشتن نمونه‌کار قوی، عدم شبکه‌سازی و مسائلی از این قبیل باشه.
          </p>
        </FaqItemComponent>
        <FaqItemComponent question="چند روز برای بوت‌کمپ در نظر گرفته شده؟">
          <p>
            در ابتدا شما باید تعهد بدید حداقل 40 روز تو این بوت‌کمپ شرکت کنید و
            تسک‌هایی که بهتون تخصیص داده میشه رو انجام بدید. همچنین باید تو تمام
            جلسات و کارگاه‌ها شرکت کنید و حضور فعالی داشته باشید.
          </p>
          <p>
            بعد از این 40 روز، اختیار با خودتونه که ادامه بدید یا بوت‌کمپ رو ترک
            کنید.
          </p>
        </FaqItemComponent>
        <FaqItemComponent question="چند ساعت در روز باید وقت بذارم؟">
          <p>مثل شغل عادی باید از ساعت 8 تا 16 در دسترس باشید.</p>
          <p>
            البته طبیعتاً بعضیا ممکنه دوست داشته باشن شب کار کنن، مشکلی از این
            بابت نیست. اما در طول روز باید در دسترس باشید چون جلساتمون تو این
            بازه‌ی زمانی برگزار میشه.
          </p>
          <p>
            از طرفی اونجایی که کارها به صورتی تیمی انجام میشه، ممکنه تسک یکی از
            هم‌تیمی‌ها مرتبط با تسک شما باشه و در این راستا بخواد با شما جلسه
            بذاره یا نیاز باشه شما تغییری تو کد بدید. بنابراین مهمه که تو یه
            بازه‌ی زمانی مشخص همه در دسترس و هماهنگ باشن.
          </p>
          <p>
            ساعت کاری شما به هیچ وجه سختگیرانه کنترل نمیشه اما انتظار میره
            تسک‌هایی که بهتون داده میشه رو به خوبی و در زمان در نظر گرفته شده
            انجام بدید.
          </p>
        </FaqItemComponent>
        <FaqItemComponent question="اگه زودتر از موعد مقرر دوره رو ترک کنم، چی میشه؟">
          <p>
            اگه به هر دلیلی وظایف خودتون رو انجام ندید یا دوره رو زودتر از 40
            روز ترک کنید، وثیقه‌ی شما به یک خیریه هدیه داده میشه.
          </p>
        </FaqItemComponent>
      </FaqComponent>
    </div>
  );
}
