import { ReactElement } from "react";

import OrderedListComponent from "@/components/ordered-list/ordered-list.component";

const rules = [
  "تمام جلسات ضبط و منتشر می‌شوند. از آنجایی که ممکن است صدا یا تصویر شما در فایل ضبط‌شده موجود باشد، حضور شما در جلسات به منزله‌ی مجوز به برگزارکننده برای ضبط و انتشار این محتواست.",
  "انتشار محتوای دوره، بدون کسب اجازه از برگزارکننده، به هر شکل و با هر عنوان ممنوع است و پیگرد قانونی دارد.",
  "ممکن است بنا بر صلاحدید برگزارکننده، محتوای دوره در اختیار افرادی غیر از شرکت‌کنندگان اصلی قرار بگیرد که این مورد می‌تواند به صورت پولی یا رایگان و به صورت عمومی یا محدود باشد.",
  "تلاش می‌شود تمام آنچه در محتوای دوره و نقشه راه مطرح شده، در جلسات تدریس شود اما به دلیل فشردگی دوره، زمان محدود و سطح شاگردان، ممکن است بخشی از مباحث مورد نظر ارائه نشود.",
  "در صورت صلاحدید برگزارکننده، ممکن است جلسات تکمیلی برگزار شود که شرکت در آن‌ها مستلزم پرداخت هزینه‌ی اضافی نیست.",
  "زمان، بستر و شیوه‌ی برگزاری جلسات در اختیار برگزارکننده است.",
  "امکان عودت وجه بعد از ثبت‌نام وجود ندارد.",
  "در اینجا منظور از برگزارکننده، بیژن عیسی‌پور است و هیچ‌یک از اشخاص حقیق و حقوقی دیگر را شامل نمی‌شود حتی اگر به هر نحوی در برگزاری دوره مشارکت داشته باشند.",
];

export default function RulesComponent(): ReactElement {
  return (
    <OrderedListComponent>
      {rules.map((rule, index) => (
        <li key={index}>{rule}</li>
      ))}
    </OrderedListComponent>
  );
}
