import { ReactElement } from "react";

import OrderedListComponent from "@/components/ordered-list/ordered-list.component";

const rules = [
  "شرکت‌کننده متعهد می‌شود به مدت 40 روز از شروع دوره، هر روز یک صلوات بفرستد و ثواب آن را به شهید رئیسی هدیه کند و تلاش کند تا جای ممکن این فرآیند به تاخیر نیفتد.",
  "شرکت‌کننده متعهد می‌شود به مدت 40 روز از شروع دوره، هر روز یک قسمت از برنامه‌ی پاورقی شبکه 2 را مشاهده کند. برای اطمینان از انجام این تعهد، در جلسات روزانه 5 دقیقه در مورد برنامه‌ی روز قبل صحبت می‌کنیم.",
  "شرکت‌کننده متعهد می‌شود پس از پایان دوره یا استخدام (هر کدام زودتر صورت یافت)، یک پست تبلیغاتی در لینکدین شخصی خود منتشر کند. محتوای این پست مربوط به شرکت در بوت‌کمپ صلواتی شهید رئیسی است.",
  "شرکت‌کننده متعهد می‌شود مبلغ 1 میلیون تومان به عنوان وثیقه نزد برگزارکننده قرار دهد. در صورتی که قبل از 40 روز از دوره انصراف دهد یا به طور کلی نظم بوت‌کمپ را مختل کند، این مبلغ به یک خیریه هدیه می‌شود. در غیر این صورت به او عودت داده خواهد شد.",

  "تمام جلسات ضبط و منتشر می‌شوند. از آنجایی که ممکن است صدا یا تصویر شما در فایل ضبط‌شده موجود باشد، حضور شما در جلسات به منزله‌ی مجوز به برگزارکننده برای ضبط و انتشار این محتواست.",
  "انتشار محتوای دوره، بدون کسب اجازه از برگزارکننده، به هر شکل و با هر عنوان ممنوع است و پیگرد قانونی دارد.",
  "ممکن است بنا بر صلاحدید برگزارکننده، محتوای دوره در اختیار افرادی غیر از شرکت‌کنندگان اصلی قرار بگیرد که این مورد می‌تواند به صورت پولی یا رایگان و به صورت عمومی یا محدود باشد.",
  "تلاش می‌شود تمام آنچه مطرح شده، در جلسات تدریس شود اما به دلیل فشردگی دوره، زمان محدود و سطح متفاوت شاگردان، ممکن است بخشی از مباحث مورد نظر ارائه نشود.",
  "زمان، بستر و شیوه‌ی برگزاری جلسات در اختیار برگزارکننده است.",
  "در اینجا منظور از برگزارکننده، بیژن عیسی‌پور است و هیچ‌یک از اشخاص حقیق و حقوقی دیگر را شامل نمی‌شود حتی اگر به هر نحوی در برگزاری دوره مشارکت داشته باشند.",
];

export default function ShahidRulesComponent(): ReactElement {
  return (
    <OrderedListComponent>
      {rules.map((rule, index) => (
        <li key={index}>{rule}</li>
      ))}
    </OrderedListComponent>
  );
}
