import { ReactElement } from "react";

import OrderedListComponent from "@/components/ordered-list/ordered-list.component";

const rules = [
  "شرکت‌کننده متعهد می‌شود به مدت 40 روز از شروع دوره، هر روز یک صلوات بفرستد و ثواب آن را به شهید رئیسی هدیه کند. در صورتی که فراموش کند یا شرایط به گونه‌ای باشد که نتواند این کار را انجام دهد، باید روزهای جامانده را بعداً جبران کند. در هر روز حداکثر یک صلوات می‌تواند فرستاده شود. شرکت‌کننده نباید از قصد این کار را به تاخیر بیندازد. در نهایت باید در مجموع 40 صلوات فرستاده شود به طوری که در هر روز دقیقاً یک صلوات فرستاده شده باشد و تا جای ممکن این فرآیند به تاخیر نیفتد.",
  "شرکت‌کننده متعهد می‌شود به مدت 40 روز از شروع دوره، هر روز یک قسمت از برنامه‌ی پاورقی شبکه 2 سیما را مشاهده کند. این قسمت باید برنامه‌ای باشد که در همان روز پخش شده و مشاهده‌ی برنامه‌های قدیمی مجاز نیست. با توجه به اینکه ممکن است قسمت‌ها دیر بارگذاری شوند، در صورت صلاحدید برگزارکننده، ممکن است مشاهده‌ی برنامه‌ها با تاخیر انجام شود. برای اطمینان از انجام صحیح این تعهد، شرکت‌کننده باید گزارش کوتاهی از آنچه مشاهده کرده آماده کند و در جلسات روزانه مطرح نماید.",
  "شرکت‌کننده متعهد می‌شود پس از پایان دوره یا استخدام (هر کدام زودتر صورت یافت)، یک پست تبلیغاتی در لینکدین شخصی خود ارسال کند و حداقل به مدت 2 ماه آن را حذف نکند. محتوای این پست مربوط به شرکت در بوت‌کمپ صلواتی شهید مفروض است و جزئیات آن بنا بر صلاحدید برگزارکننده مشخص می‌شود.",
  "شرکت‌کننده متعهد می‌شود مبلغ 1 میلیون تومان به عنوان وثیقه نزد برگزارکننده قرار دهد. در صورتی که شرکت‌کننده بعد از 40 روز از شروع دوره، وظایف خود را طبق نظر برگزارکننده انجام داده باشد و در این مدت دوره را به طور موقت یا دائم ترک نکرده باشد، این مبلغ به شرکت‌کننده عودت داده می‌شود. در غیر این صورت، اگر به هر دلیلی برگزارکننده از عملکرد شرکت‌کننده راضی نباشد، تمام مبلغ مذکور نزد برگزارکننده باقی می‌مانند و برگزارکننده اجازه دارد به هر نحو آن را صرف کند و شرکت‌کننده حق هیچگونه اعتراضی را ندارد.",

  "تمام جلسات ضبط و منتشر می‌شوند. از آنجایی که ممکن است صدا یا تصویر شما در فایل ضبط‌شده موجود باشد، حضور شما در جلسات به منزله‌ی مجوز به برگزارکننده برای ضبط و انتشار این محتواست.",
  "انتشار محتوای دوره، بدون کسب اجازه از برگزارکننده، به هر شکل و با هر عنوان ممنوع است و پیگرد قانونی دارد.",
  "ممکن است بنا بر صلاحدید برگزارکننده، محتوای دوره در اختیار افرادی غیر از شرکت‌کنندگان اصلی قرار بگیرد که این مورد می‌تواند به صورت پولی یا رایگان و به صورت عمومی یا محدود باشد.",
  "تلاش می‌شود تمام آنچه مطرح شده، در جلسات تدریس شود اما به دلیل فشردگی دوره، زمان محدود و سطح متفاوت شاگردان، ممکن است بخشی از مباحث مورد نظر ارائه نشود.",
  "زمان، بستر و شیوه‌ی برگزاری جلسات در اختیار برگزارکننده است.",
  "در اینجا منظور از برگزارکننده، بیژن عیسی‌پور است و هیچ‌یک از اشخاص حقیق و حقوقی دیگر را شامل نمی‌شود حتی اگر به هر نحوی در برگزاری دوره مشارکت داشته باشند.",
];

export default function ShahidRulesComponent(): ReactElement {
  return (
    <OrderedListComponent>
      {rules.map((rule, index) => (
        <li key={index}>{rule}</li>
      ))}
    </OrderedListComponent>
  );
}
